app/Controllers/Admin/Penjualan/PenjualanController.php

    public function index()
    {
        return view('template', [
            'body'          => 'Admin/Penjualan/index',
            'customer_list' => $this->customerModel->findAll(),
---
SELECT *
FROM `customer`

    public function datatable()
    {
        $draw   = $this->request->getGet('draw');
        $start  = $this->request->getGet('start') ?? 0;
        $length = $this->request->getGet('length') ?? 10;
        $search = $this->request->getGet('search')['value'] ?? '';

        $db      = \Config\Database::connect();
        $builder = $db->table('penjualan p')
            ->select('p.idpenjualan, p.no_transaksi, c.nama_customer, p.total, p.diskon, p.grand_total, p.created_at, pg.nama_pegawai')
            ->join('customer c', 'c.idcustomer = p.idcustomer', 'left')
            ->join('pegawai pg', 'pg.idpegawai = p.input_by', 'left');

        $total = (clone $builder)->countAllResults(false);
        if (!empty($search)) {
            $builder->groupStart()
                ->like('p.no_transaksi', $search)
                ->orLike('c.nama_customer', $search)
                ->groupEnd();
        }

        $filtered = (clone $builder)->countAllResults(false);
        $rows     = $builder->orderBy('p.idpenjualan', 'DESC')->limit($length, $start)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `penjualan` `p`
LEFT JOIN `customer` `c` ON `c`.`idcustomer` = `p`.`idcustomer`
LEFT JOIN `pegawai` `pg` ON `pg`.`idpegawai` = `p`.`input_by`
SELECT `p`.`idpenjualan`, `p`.`no_transaksi`, `c`.`nama_customer`, `p`.`total`, `p`.`diskon`, `p`.`grand_total`, `p`.`created_at`, `pg`.`nama_pegawai`
FROM `penjualan` `p`
LEFT JOIN `customer` `c` ON `c`.`idcustomer` = `p`.`idcustomer`
LEFT JOIN `pegawai` `pg` ON `pg`.`idpegawai` = `p`.`input_by`
ORDER BY `p`.`idpenjualan` DESC
 LIMIT 10