app/Controllers/Admin/Pembelian/PembelianController.php

SELECT *
FROM `vendor`
WHERE `deleted` = 0
---
    public function index()
    {
        return view('template', [
            'body'          => 'Admin/Pembelian/index',
            'supplier_list' => $this->vendorModel->where('deleted', 0)->findAll(),

SELECT COUNT(*) AS `numrows`
FROM `pembelian` `p`
LEFT JOIN `vendor` `v` ON `v`.`idsupplier` = `p`.`idsupplier`
LEFT JOIN `pegawai` `pg` ON `pg`.`idpegawai` = `p`.`input_by`
SELECT `p`.`idpembelian`, `p`.`no_pembelian`, `v`.`nama_supplier`, `p`.`total`, `p`.`created_at`, `pg`.`nama_pegawai`
FROM `pembelian` `p`
LEFT JOIN `vendor` `v` ON `v`.`idsupplier` = `p`.`idsupplier`
LEFT JOIN `pegawai` `pg` ON `pg`.`idpegawai` = `p`.`input_by`
ORDER BY `p`.`idpembelian` DESC
 LIMIT 10
---
    public function datatable()
    {
        $draw   = $this->request->getGet('draw');
        $start  = $this->request->getGet('start') ?? 0;
        $length = $this->request->getGet('length') ?? 10;
        $search = $this->request->getGet('search')['value'] ?? '';

        $db      = \Config\Database::connect();
        $builder = $db->table('pembelian p')
            ->select('p.idpembelian, p.no_pembelian, v.nama_supplier, p.total, p.created_at, pg.nama_pegawai')
            ->join('vendor v', 'v.idsupplier = p.idsupplier', 'left')
            ->join('pegawai pg', 'pg.idpegawai = p.input_by', 'left');

        $total = (clone $builder)->countAllResults(false);
        if (!empty($search)) {
            $builder->groupStart()
                ->like('p.no_pembelian', $search)
                ->orLike('v.nama_supplier', $search)
                ->groupEnd();
        }

        $filtered = (clone $builder)->countAllResults(false);
        $rows     = $builder->orderBy('p.idpembelian', 'DESC')->limit($length, $start)->get()->getResultArray();

SELECT *
FROM `lensa`
WHERE `deleted` = 0
AND  `nama_lensa` LIKE '%%' ESCAPE '!'
 LIMIT 20
SELECT *
FROM `frame`
WHERE `nama_frame` LIKE '%%' ESCAPE '!'
 LIMIT 20
---
    public function searchProduk()
    {
        $jenis   = $this->request->getGet('jenis');
        $keyword = $this->request->getGet('q') ?? '';
        $result  = [];

        switch ($jenis) {
            case 'lensa':
                $rows = (new LensaModel())->where('deleted', 0)->like('nama_lensa', $keyword)->findAll(20);
                foreach ($rows as $r) {
                    $result[] = ['id' => $r['idframe'], 'text' => $r['nama_lensa'], 'harga' => $r['harga_beli']];
                }
                break;
            case 'frame':
                $rows = (new FrameModel())->like('nama_frame', $keyword)->findAll(20);