app/Controllers/Admin/Stok/StokController.php

    public function frame()
    {
        return view('template', [
            'body'        => 'Admin/Stok/frame',
            'frame_list'  => (new FrameModel())->findAll(),
---
SELECT *
FROM `frame`

    public function datatableFrame()
    {
        $draw   = $this->request->getGet('draw');
        $start  = $this->request->getGet('start') ?? 0;
        $length = $this->request->getGet('length') ?? 10;
        $search = $this->request->getGet('search')['value'] ?? '';

        $db      = \Config\Database::connect();
        $builder = $db->table('stok_frame sf')
            ->select('sf.idstok_frame, f.nama_frame, sf.jumlah')
            ->join('frame f', 'f.idframe = sf.idframe', 'left');

        $total = (clone $builder)->countAllResults(false);
        if (!empty($search)) {
            $builder->like('f.nama_frame', $search);
        }
        $filtered = (clone $builder)->countAllResults(false);
        $rows     = $builder->limit($length, $start)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `stok_frame` `sf`
LEFT JOIN `frame` `f` ON `f`.`idframe` = `sf`.`idframe`
SELECT `sf`.`idstok_frame`, `sf`.`idframe`, `f`.`nama_frame`, `sf`.`jumlah`
FROM `stok_frame` `sf`
LEFT JOIN `frame` `f` ON `f`.`idframe` = `sf`.`idframe`
 LIMIT 10

    public function riwayatFrame($idframe)
    {
        $db   = \Config\Database::connect();
        $rows = $db->table('riwayat_stok_frame r')
            ->select('r.*, f.nama_frame, p.nama_pegawai')
            ->join('frame f', 'f.idframe = r.idframe', 'left')
            ->join('pegawai p', 'p.idpegawai = r.created_by', 'left')
            ->where('r.idframe', $idframe)
            ->orderBy('r.created_at', 'DESC')
            ->limit(50)
            ->get()->getResultArray();
---
SELECT `r`.*, `f`.`nama_frame`, `p`.`nama_pegawai`
FROM `riwayat_stok_frame` `r`
LEFT JOIN `frame` `f` ON `f`.`idframe` = `r`.`idframe`
LEFT JOIN `pegawai` `p` ON `p`.`idpegawai` = `r`.`created_by`
WHERE `r`.`idframe` = '1'
ORDER BY `r`.`created_at` DESC
 LIMIT 50

    public function lensa()
    {
        return view('template', [
            'body'       => 'Admin/Stok/lensa',
            'lensa_list' => (new LensaModel())->where('deleted', 0)->findAll(),
        ]);
---
SELECT *
FROM `lensa`
WHERE `deleted` = 0

    public function datatableLensa()
    {
        $draw   = $this->request->getGet('draw');
        $start  = $this->request->getGet('start') ?? 0;
        $length = $this->request->getGet('length') ?? 10;
        $search = $this->request->getGet('search')['value'] ?? '';

        $db      = \Config\Database::connect();
        $builder = $db->table('stok_lensa sl')
            ->select('sl.idstok_lensa, l.idframe as idlensa, l.nama_lensa, sl.jumlah')
            ->join('lensa l', 'l.idframe = sl.idlensa', 'left');

        $total = (clone $builder)->countAllResults(false);
        if (!empty($search)) $builder->like('l.nama_lensa', $search);
        $filtered = (clone $builder)->countAllResults(false);
        $rows     = $builder->limit($length, $start)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `stok_lensa` `sl`
LEFT JOIN `lensa` `l` ON `l`.`idframe` = `sl`.`idlensa`
SELECT `sl`.`idstok_lensa`, `l`.`idframe` as `idlensa`, `l`.`nama_lensa`, `sl`.`jumlah`
FROM `stok_lensa` `sl`
LEFT JOIN `lensa` `l` ON `l`.`idframe` = `sl`.`idlensa`
 LIMIT 10

    public function riwayatLensa($idlensa)
    {
        $db   = \Config\Database::connect();
        $rows = $db->table('riwayat_stok_lensa r')
            ->select('r.*, l.nama_lensa, p.nama_pegawai')
            ->join('lensa l', 'l.idframe = r.idlensa', 'left')
            ->join('pegawai p', 'p.idpegawai = r.created_by', 'left')
            ->where('r.idlensa', $idlensa)
            ->orderBy('r.created_at', 'DESC')
            ->limit(50)
            ->get()->getResultArray();
---
SELECT `r`.*, `l`.`nama_lensa`, `p`.`nama_pegawai`
FROM `riwayat_stok_lensa` `r`
LEFT JOIN `lensa` `l` ON `l`.`idframe` = `r`.`idlensa`
LEFT JOIN `pegawai` `p` ON `p`.`idpegawai` = `r`.`created_by`
WHERE `r`.`idlensa` = '1'
ORDER BY `r`.`created_at` DESC
 LIMIT 50

    public function kacamata()
    {
        return view('template', [
            'body'          => 'Admin/Stok/kacamata',
            'kacamata_list' => (new KacamataModel())->where('deleted', 0)->findAll(),
        ]);
---
SELECT *
FROM `kacamata`
WHERE `deleted` = 0

    public function datatableKacamata()
    {
        $draw   = $this->request->getGet('draw');
        $start  = $this->request->getGet('start') ?? 0;
        $length = $this->request->getGet('length') ?? 10;
        $search = $this->request->getGet('search')['value'] ?? '';

        $db      = \Config\Database::connect();
        $builder = $db->table('stok_kacamata sk')
            ->select('sk.idstok_kacamata, k.idkacamata, k.nama_kacamata, sk.jumlah')
            ->join('kacamata k', 'k.idkacamata = sk.idkacamata', 'left');

        $total = (clone $builder)->countAllResults(false);
        if (!empty($search)) $builder->like('k.nama_kacamata', $search);
        $filtered = (clone $builder)->countAllResults(false);
        $rows     = $builder->limit($length, $start)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `stok_kacamata` `sk`
LEFT JOIN `kacamata` `k` ON `k`.`idkacamata` = `sk`.`idkacamata`
SELECT `sk`.`idstok_kacamata`, `k`.`idkacamata`, `k`.`nama_kacamata`, `sk`.`jumlah`
FROM `stok_kacamata` `sk`
LEFT JOIN `kacamata` `k` ON `k`.`idkacamata` = `sk`.`idkacamata`
 LIMIT 10

    public function riwayatKacamata($idkacamata)
    {
        $db   = \Config\Database::connect();
        $rows = $db->table('riwayat_stok_kacamata r')
            ->select('r.*, k.nama_kacamata, p.nama_pegawai')
            ->join('kacamata k', 'k.idkacamata = r.idkacamata', 'left')
            ->join('pegawai p', 'p.idpegawai = r.created_by', 'left')
            ->where('r.idkacamata', $idkacamata)
            ->orderBy('r.created_at', 'DESC')
            ->limit(50)
            ->get()->getResultArray();
---
SELECT `r`.*, `k`.`nama_kacamata`, `p`.`nama_pegawai`
FROM `riwayat_stok_kacamata` `r`
LEFT JOIN `kacamata` `k` ON `k`.`idkacamata` = `r`.`idkacamata`
LEFT JOIN `pegawai` `p` ON `p`.`idpegawai` = `r`.`created_by`
WHERE `r`.`idkacamata` = '1'
ORDER BY `r`.`created_at` DESC
 LIMIT 50